use std::{
    ffi::CStr,
    os::unix::process::parent_id,
    time::{SystemTime, UNIX_EPOCH},
};

use zerocopy::FromZeros;

/* automatically generated by rust-bindgen 0.70.1 */
#[derive(Debug)]
pub struct Foo {
    pub x: i32,
}

#[derive(Debug)]
pub struct FileSystem<'a> {
    sb: superblock_t,
    data: &'a mut [u8],
    // inode_bitmap: block_p,
    // inodes: block_p,
    // blocks_bitmap: block_p,
    // first_block: block_p,
    inode_bitmap: Bitmap<'a>,
    inodes: &'a mut [u8],
    blocks_bitmap: Bitmap<'a>,
    data_blocks: &'a mut [u8],
}

impl<'a> FileSystem<'a> {
    pub fn new(data: &'a mut [u8]) -> Self {
        let sb_data: [u8; 28] = data[0..28].try_into().unwrap();
        let mut sb: superblock_t = zerocopy::transmute!(sb_data);
        sb.block_size = 1024;
        sb.blocks_num = 16384;
        sb.inodes_num = 1024 * 8;

        let inode_bitmap_id = 1;
        let inodes_id = if sb.inodes_num % (8 * sb.block_size) == 0 {
            sb.inodes_num / (8 * sb.block_size) + inode_bitmap_id
        } else {
            sb.inodes_num / (8 * sb.block_size) + 2
        };

        let blocks_bitmap_id = if (sb.inodes_num * 128) % (sb.block_size) == 0 {
            (sb.inodes_num * 128) / (sb.block_size) + inodes_id
        } else {
            (sb.inodes_num * 128) / (sb.block_size) + inodes_id + 1
        };

        let data_blocks = sb.blocks_num - blocks_bitmap_id;
        let first_block_id = if data_blocks % (8 * sb.block_size) == 0 {

                _ => unreachable!("modulo lol"),
            },
        })
    }
}

struct DentryMut<'a> {
    inode_num: inode_p,
    size: usize,
    data: &'a mut [u8],
}

impl<'a> DentryMut<'a> {
    fn from(data: &'a mut [u8]) -> Option<Self> {
        let mut data = &mut data[..];
        let mut i = 0;
        while data.len() >= 8 && u32::from_le_bytes(data[0..4].try_into().unwrap()) == 0 {
            data = &mut data[4..];
            i += 4;
        }
        if data.len() < 8 {
            println!("too small");
            return None;
            //"dentry too small"
        }
        let inode_num = inode_p::from_le_bytes(data[0..4].try_into().unwrap());
        if inode_num == 0 {
            println!("inode 0");
            return None;
        }
        let size = u32::from_le_bytes(data[4..8].try_into().unwrap());
        if data.len() < (8 + size) as usize {
            println!("size wrong");
            return None;
            //"dir name size incorrect"
        }
        Some(Self {
            inode_num,
            // size: size as usize + 8,
            size: match size % 4 {
                0 => size as usize + 8 + i,
                1 => size as usize + 8 + i + 3,
                2 => size as usize + 8 + i + 2,
                3 => size as usize + 8 + i + 1,
                _ => unreachable!("modulo lol"),
            },
            data: &mut data[..8 + size as usize],
        })
    }

    fn delete(&mut self) {
        self.data.zero();
    }

    fn get_name(&self) -> &str {
        std::str::from_utf8(&self.data[8..])
            .expect(&format!("bad file name {:?}", &self.data[8..],))
    }
}

#[repr(C)]
#[derive(Debug, Copy, Clone, zerocopy_derive::FromBytes, zerocopy_derive::IntoBytes)]
pub struct superblock_t {
    pub header: [::std::os::raw::c_char; 8usize],
    pub inodes_num: ::std::os::raw::c_uint,
    pub blocks_num: ::std::os::raw::c_uint,
    pub block_size: ::std::os::raw::c_uint,
    pub free_blocks: ::std::os::raw::c_uint,
    pub free_inodes: ::std::os::raw::c_uint,
}

#[derive(Debug)]
pub struct Goo<const T: usize> {
    pub goo: [u8; T],
}

//#[repr()]
#[derive(zerocopy_derive::FromBytes, zerocopy_derive::IntoBytes, Debug)]
pub struct Boo {
    pub x: f32,
    pub y: f32,
    pub c: [u8; 20],
}

impl From<[i8; 8]> for superblock_t {
    fn from(value: [i8; 8]) -> Self {
        superblock_t {
            header: [0; 8],
            inodes_num: 1, //u32::from_le_bytes(value[4..].try_into().unwrap()),
            blocks_num: 1, /*value[0..4].try_into().unwrap()*/
            block_size: 1,
            free_blocks: 1,
            free_inodes: 1,
        }
    }
}

impl From<Foo> for superblock_t {
    fn from(value: Foo) -> Self {
        superblock_t {
            header: [0; 8],
            inodes_num: value.x as u32,
            blocks_num: 1,
            block_size: 1,
            free_blocks: 1,
            free_inodes: 1,
        }
    }
}

#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of superblock_t"][::std::mem::size_of::<superblock_t>() - 28usize];
    ["Alignment of superblock_t"][::std::mem::align_of::<superblock_t>() - 4usize];
    ["Offset of field: superblock_t::header"]
        [::std::mem::offset_of!(superblock_t, header) - 0usize];
    ["Offset of field: superblock_t::inodes_num"]
        [::std::mem::offset_of!(superblock_t, inodes_num) - 8usize];
    ["Offset of field: superblock_t::blocks_num"]
        [::std::mem::offset_of!(superblock_t, blocks_num) - 12usize];
    ["Offset of field: superblock_t::block_size"]
        [::std::mem::offset_of!(superblock_t, block_size) - 16usize];
    ["Offset of field: superblock_t::free_blocks"]
        [::std::mem::offset_of!(superblock_t, free_blocks) - 20usize];
    ["Offset of field: superblock_t::free_inodes"]
        [::std::mem::offset_of!(superblock_t, free_inodes) - 24usize];
};
pub type block_p = ::std::os::raw::c_uint;
pub type inode_p = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone, zerocopy_derive::FromBytes, zerocopy_derive::IntoBytes)]
pub struct inode_t {
    pub type_perm: ::std::os::raw::c_ushort,
    pub uid: ::std::os::raw::c_ushort,
    pub gid: ::std::os::raw::c_ushort,
    pub pad1: ::std::os::raw::c_ushort,
    pub size: ::std::os::raw::c_uint,
    pub pad2: ::std::os::raw::c_uint,
    pub access_time: ::std::os::raw::c_ulonglong,
    pub mod_time: ::std::os::raw::c_ulonglong,
    pub creat_time: ::std::os::raw::c_ulonglong,
    pub hard_links: ::std::os::raw::c_uint,
    pub direct_blocks: [block_p; 12usize],
    pub sin_inblock: block_p,
    pub dob_inblock: block_p,
    pub tri_inblock: block_p,
    pub unused: [::std::os::raw::c_char; 24usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of inode_t"][::std::mem::size_of::<inode_t>() - 128usize];
    ["Alignment of inode_t"][::std::mem::align_of::<inode_t>() - 8usize];
    ["Offset of field: inode_t::type_perm"][::std::mem::offset_of!(inode_t, type_perm) - 0usize];
    ["Offset of field: inode_t::uid"][::std::mem::offset_of!(inode_t, uid) - 2usize];
    ["Offset of field: inode_t::gid"][::std::mem::offset_of!(inode_t, gid) - 4usize];
    ["Offset of field: inode_t::size"][::std::mem::offset_of!(inode_t, size) - 8usize];
    ["Offset of field: inode_t::access_time"]
        [::std::mem::offset_of!(inode_t, access_time) - 16usize];
    ["Offset of field: inode_t::mod_time"][::std::mem::offset_of!(inode_t, mod_time) - 24usize];
    ["Offset of field: inode_t::creat_time"][::std::mem::offset_of!(inode_t, creat_time) - 32usize];
    ["Offset of field: inode_t::hard_links"][::std::mem::offset_of!(inode_t, hard_links) - 40usize];
    ["Offset of field: inode_t::direct_blocks"]
        [::std::mem::offset_of!(inode_t, direct_blocks) - 44usize];
    ["Offset of field: inode_t::sin_inblock"]
        [::std::mem::offset_of!(inode_t, sin_inblock) - 92usize];
    ["Offset of field: inode_t::dob_inblock"]
        [::std::mem::offset_of!(inode_t, dob_inblock) - 96usize];
    ["Offset of field: inode_t::tri_inblock"]
        [::std::mem::offset_of!(inode_t, tri_inblock) - 100usize];
    ["Offset of field: inode_t::unused"][::std::mem::offset_of!(inode_t, unused) - 104usize];
};
extern "C" {
    pub fn get_block(sb: *mut superblock_t, id: block_p) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn get_inode_by_id(sb: *mut superblock_t, id: inode_p) -> *mut inode_t;
}
extern "C" {
    pub fn take_inode(sb: *mut superblock_t, id: inode_p);
}
extern "C" {
    pub fn get_free_data_block(sb: *mut superblock_t) -> block_p;
}
extern "C" {
    pub fn test(sb: *mut superblock_t);
}
extern "C" {
    pub fn find_free_inode(sb: *mut superblock_t) -> inode_p;
}
extern "C" {
    pub fn find_inode_by_path(
        sb: *mut superblock_t,
        path: *const ::std::os::raw::c_char,
    ) -> *mut inode_t;
}
extern "C" {
    pub fn search_dir(cur: *mut inode_t, path: *const ::std::os::raw::c_char) -> *mut inode_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dentry_t_t {
    pub inode: inode_p,
    pub size: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dentry_t_t"][::std::mem::size_of::<dentry_t_t>() - 8usize];
    ["Alignment of dentry_t_t"][::std::mem::align_of::<dentry_t_t>() - 4usize];
    ["Offset of field: dentry_t_t::inode"][::std::mem::offset_of!(dentry_t_t, inode) - 0usize];
    ["Offset of field: dentry_t_t::size"][::std::mem::offset_of!(dentry_t_t, size) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct filesystem_t {
    pub sb: superblock_t,
    pub inodes: *mut inode_t,
    pub blocks: *mut block_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of filesystem_t"][::std::mem::size_of::<filesystem_t>() - 48usize];
    ["Alignment of filesystem_t"][::std::mem::align_of::<filesystem_t>() - 8usize];
    ["Offset of field: filesystem_t::sb"][::std::mem::offset_of!(filesystem_t, sb) - 0usize];
    ["Offset of field: filesystem_t::inodes"]
        [::std::mem::offset_of!(filesystem_t, inodes) - 32usize];
    ["Offset of field: filesystem_t::blocks"]
        [::std::mem::offset_of!(filesystem_t, blocks) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct block_t {
    pub _address: u8,
}
